app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "test_1"], ["LIMIT", 1]]
---
  def create
    @user = User.new(login_params)
    if @user.invalid?
      render :new
    else
      login_user = User.find_by_user_id(login_params[:user_id])